DataProcessors/TouchКолонкаТабличногоПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>TouchКолонкаТабличногоПоля</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьОтрицательные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтальноеПоложениеВКолонке</Name>
					<Type>
						<v8:Type>v8ui:HorizontalAlign</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтальноеПоложениеВПодвале</Name>
					<Type>
						<v8:Type>v8ui:HorizontalAlign</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоризонтальноеПоложениеВШапке</Name>
					<Type>
						<v8:Type>v8ui:HorizontalAlign</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеФлажка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменениеРазмера</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаПодвала</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаШапки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВложенныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВПодвале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВШапке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьИерархию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Положение</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тег</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодвала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШапки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаПодвала</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаПоля</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаШапки</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаПодвала</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаПоля</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаШапки</Name>
					<Type>
						<v8:Type>v8ui:Color</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЭлементаВложенныхДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтПодвала</Name>
					<Type>
						<v8:Type>v8ui:Font</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтТекста</Name>
					<Type>
						<v8:Type>v8ui:Font</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШрифтШапки</Name>
					<Type>
						<v8:Type>v8ui:Font</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/TouchКолонкаТабличногоПоля/Ext/ObjectModule.bsl
//	1С:Touch. Touch-ориентированные элементы управления и диалоговые формы, 
//	построенные с использованием только стандартных элементов управления платформы.
//	Copyright (C) 2008-2010 Переверзев Александр Владимирович.
//
//	Это программа является свободным программным обеспечением. Вы можете 
//	распространять и/или модифицировать её согласно условиям Стандартной 
//	Общественной Лицензии GNU, опубликованной Фондом Свободного Программного 
//	Обеспечения, версии 3 или, по Вашему желанию, любой более поздней версии. 
//
//	Эта программа распространяется в надежде, что она будет полезной, но БЕЗ 
//	ВСЯКИХ ГАРАНТИЙ, в том числе подразумеваемых гарантий ТОВАРНОГО СОСТОЯНИЯ ПРИ 
//	ПРОДАЖЕ и ГОДНОСТИ ДЛЯ ОПРЕДЕЛЁННОГО ПРИМЕНЕНИЯ. Смотрите Стандартную 
//	Общественную Лицензию GNU для получения дополнительной информации. 
//
//	Вы должны были получить копию Стандартной Общественной Лицензии GNU вместе 
//	с программой. В случае её отсутствия, посмотрите <http://www.gnu.org/licenses/>.


#Если Клиент Тогда

Перем мИдентификатор, мИмя;

Перем мИменаКолонок, мИндексыКолонок;

Перем мТипСтруктуры;


Функция Имя(Имя = Неопределено) Экспорт
	
	// Проверка входных параметров.
	
	// TODO: Проверка входных параметров.
	
	// Инициализация кнопки.
	Если (мИменаКолонок = Неопределено) И (ТипЗнч(Имя) = мТипСтруктуры) Тогда
		Параметры = Имя;
		
		мИмя = Строка(Параметры.Имя);
		
		мИменаКолонок = Параметры.ИменаКолонок;
		мИндексыКолонок = Параметры.ИндексыКолонок;

		Параметры.Идентификатор = мИдентификатор;
		
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка инициализации.
	Если (мИменаКолонок = Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получение имени кнопки или изменение имени.
	Если (Имя = Неопределено) Тогда
		
		Возврат мИмя;
		
	Иначе
		
		мИменаКолонок.Удалить(мИмя);
		
		мИмя = Строка(Имя);
		
		мИменаКолонок.Вставить(мИмя, мИдентификатор);
		
		Возврат мИмя;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Индекс(Индекс = Неопределено) Экспорт
	
	// Проверка входных параметров.
	
	// TODO: Проверка входных параметров.
	
	// Проверка инициализации.
	Если (мИндексыКолонок = Неопределено) Тогда
		
		// TODO: Исключение.

		Возврат Неопределено;
	КонецЕсли;
	
	// Смещение кнопки.
	Если (Не Индекс = Неопределено) Тогда
		Элемент = мИндексыКолонок.НайтиПоЗначению(мИдентификатор);
		мИндексыКолонок.Сдвинуть(Элемент, Индекс - мИндексыКолонок.Индекс(Элемент));	
	КонецЕсли;
	
	// Получение индекса кнопки.
	Возврат мИндексыКолонок.Индекс(мИндексыКолонок.НайтиПоЗначению(мИдентификатор));
	
КонецФункции


Процедура Высвободить() Экспорт
	
	// Высвобождение ссылок.
	мИменаКолонок = Неопределено;
	мИндексыКолонок = Неопределено;
	
КонецПроцедуры // Высвободить()


// Инициализация переменных.
мИдентификатор = Строка(Новый УникальныйИдентификатор);

мТипСтруктуры = Тип("Структура");


// Инициализация значений по умолчанию.
Видимость = Истина;
ГоризонтальноеПоложениеВКолонке = ГоризонтальноеПоложение.Авто;
ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложение.Лево;
ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложение.Лево;
Доступность = Истина;
ИзменениеРазмера = ИзменениеРазмераКолонки.Изменять;
КартинкаПодвала = Новый Картинка;
КартинкаШапки = КартинкаПодвала;
КартинкиСтрок = КартинкаПодвала;
ОтображатьВПодвале = Истина;
ОтображатьВШапке = Истина;
Положение = ПоложениеКолонки.НоваяКолонка;
ЦветТекстаПодвала = ЦветаСтиля.ЦветТекстаФормы;
ЦветТекстаПоля = ЦветаСтиля.ЦветТекстаФормы;
ЦветТекстаШапки = ЦветаСтиля.ЦветТекстаФормы;
ЦветФонаПодвала = ЦветаСтиля.ЦветФонаКнопки;
ЦветФонаПоля = ЦветаСтиля.ЦветФонаПоля;
ЦветФонаШапки = ЦветаСтиля.ЦветФонаКнопки;
Ширина = 20;
ШиринаЭлементаВложенногоСпискаЗначений = 20;
ШрифтПодвала = ШрифтыСтиля.ШрифтТекста;
ШрифтТекста = ШрифтыСтиля.ШрифтТекста;
ШрифтШапки = ШрифтыСтиля.ШрифтТекста;

#КонецЕсли
